# Reshaping Data with Pandas

When working with data, it is common to encounter situations where the format of your `DataFrame` is not ideal for analysis or visualization. Reshaping data can help you transform the structure of your data to better suit your needs. This recipe illustrates two powerful tools available in Pandas for reshaping data, namely


- `pivot`: This method allows you to "pivot" a DataFrame, turning unique values from one column into new columns and filling them with corresponding values from another column. It is especially useful for converting long-form data (also known as tidy data) into a wide format.
  
- `melt`: This method is the inverse of pivot. It is used to "melt" a wide-format DataFrame into a long-format, where multiple columns are unpivoted into a single column, making it easier to work with or visualize when you have a large number of variables.

## Getting ready
Before starting, we are going to create two `DataFrame` objects to work with.

- `df_vertical` this data is in a vertical/long format where each row represents a record of a single observation or instance, and each column represents a single variable. 
  
- `df_horizontal` this data is in horizontal/wide format where multiple columns/rows represent levels of a categorical variable.

In [38]:
import pandas as pd
import numpy as np

In [39]:
df_vertical = pd.DataFrame({
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar', 'Apr', 'Apr'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'South'],
    'Product': ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B'],
    'Sales': [250, 200, 260, 210, 270, 220, 180, 210],
    'Costs': [130, 100, 130, 100, 120, 120, 100, 100]
})

df_vertical

  Month Region Product  Sales  Costs
0   Jan  North       A    250    130
1   Jan  South       A    200    100
2   Feb  North       A    260    130
3   Feb  South       A    210    100
4   Mar  North       A    270    120
5   Mar  South       A    220    120
6   Apr  North       B    180    100
7   Apr  South       B    210    100

In [40]:
df_horizontal = pd.DataFrame({
    'Month': ['Jan', 'Feb', 'Mar', 'Apr'],
    'North': [250, 260, 270, 180],
    'South': [200, 210, 220, 210]
})
df_horizontal

  Month  North  South
0   Jan    250    200
1   Feb    260    210
2   Mar    270    220
3   Apr    180    210

## How to do it 

1. Convert the `df_vertical` into horizontal/wide format by using the method `pivot`

In [41]:
df_vertical.pivot(index='Month', columns='Region', values='Sales')

Region  North  South
Month
Apr       180    210
Feb       260    210
Jan       250    200
Mar       270    220

In this format each row represents a month, each column represents a region, and the sales values are filled in accordingly. Here, the `Month` column becomes the index, the `Region` column values become the column names, and the `Sales` values are filled into the corresponding cells.

In [42]:
df_vertical.pivot(index='Month', columns='Region', values=['Costs', 'Sales'])

       Costs       Sales
Region North South North South
Month
Apr      100   100   180   210
Feb      130   100   260   210
Jan      130   100   250   200
Mar      120   120   270   220

In [43]:
df_vertical.pivot(index='Month', columns=['Product', 'Region'], values=['Sales'])

         Sales
Product      A             B
Region   North  South  North  South
Month
Apr        NaN    NaN  180.0  210.0
Feb      260.0  210.0    NaN    NaN
Jan      250.0  200.0    NaN    NaN
Mar      270.0  220.0    NaN    NaN

In [45]:
melted_df = pd.melt(df_horizontal, id_vars=['Month'], value_vars=['North', 'South'], var_name='Region', value_name='Sales')
melted_df

  Month Region  Sales
0   Jan  North    250
1   Feb  North    260
2   Mar  North    270
3   Apr  North    180
4   Jan  South    200
5   Feb  South    210
6   Mar  South    220
7   Apr  South    210